<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 中间件配置
// +----------------------------------------------------------------------
return [
    // 默认中间件命名空间
    'default_namespace' => 'app\\common\\middleware\\',
    
    // 优先级设置，此数组中的中间件会按照数组中的顺序优先执行
    'priority' => [
        'app\\common\\middleware\\AllowCrossDomain'
    ],
    
    // 全局中间件
    'alias' => [
        'cors' => 'app\\common\\middleware\\AllowCrossDomain',
        'jwt' => 'app\\http\\middleware\\Jwt'
    ],
    
    // 应用中间件
    'app' => [
        'cors'
    ],
];
